---
kind: type
id: T:Autodesk.Revit.DB.Structure.FabricLocation
source: html/965ab895-2f32-baaa-b065-d9cc4f359357.htm
---
# Autodesk.Revit.DB.Structure.FabricLocation

Fabric location in the host

## Syntax (C#)
```csharp
public enum FabricLocation
```